# coding: utf-8
ACCINFO = {
    13: {
        'mchname': '深圳市鼎点点科技有限公司',
        'name': '李坚',
        # 'idinfo': '431126198510087051',
        'bankaccount': '152532191',
        'bank': '中国民生银行股份有限公司深圳龙华支行',
    },
    14: {
        'mchname': '深圳传盛网络科技有限公司',
        'name': '深圳传盛网络科技有限公司',
        'bankaccount': '4000092509100485013',
        'bank': '中国工商银行深圳宝民支行'
    },
    15: {
        'mchname': '深圳市付通电子科技有限公司',
        'name': '吴婷',
        # 'idinfo': '421023199005170442',
        'bankaccount': '20000035311600018158718',
        'bank': '北京银行股份有限公司深圳分行',
    },
    16: {
        'mchname': '深圳市德源互联科技有限公司',
        'name': '肖泽鑫',
        # 'idinfo': '44522119880124655X',
        'bankaccount': '44201530300052539956',
        'bank': '中国建设银行股份有限公司深圳泰然支行',
    },
    18: {
        'mchname': '上海桔梗网络科技有限公司',
        'name': '韩坤',
        # 'idinfo': '44522119880124655X',
        'bankaccount': '6212262402009041126',
        'bank': '中国工商银行贵阳油榨支行',
    },
    22: {
        'mchname': '福建省京豪网络科技有限公司',
        'name': '赖建荣',
        # 'idinfo': '622908173000646926',
        'bankaccount': '6212262402009041126',
        'bank': '兴业银行龙岩新兴支行',
    },
    23: {
        'mchname': '福州万泰融实业有限公司',
        'name': '林慧荣',
        'bankaccount': '350524198908093513',
        'bank': '招商银行福州湖东支行'
    },
    24: {
        'mchname': '深圳市卓朗云集科技有限公司',
        'name': '陈广',
        'bankaccount': '6217921070230035',
        'bank': '上海浦东发展银行股份有限公司广州中山分行'
    },
    25: {
        'mchname': '中山市卓朗科技有限公司',
        'name': '陈广',
        'bankaccount': '6217921070230035',
        'bank': '上海浦东发展银行股份有限公司广州中山分行'
    },
    26: {
        'mchname': '深圳市易佰通电子商务有限公司',
        'name': '李德品',
        'bankaccount': '6226194600476408',
        'bank': '中国民生银行中国民生银行股份有限公司中山分行营业部'
    },
    32: {
        'mchname': '深圳缘游网络科技有限公司',
        'name': '深圳缘游网络科技有限公司',
        'bankaccount': '741968738438',
        'bank': '中国银行深圳东乐支行'
    },
    34: {
        'mchname': '武汉趣享互动科技有限公司',
        'name': '武汉趣享互动科技有限公司',
        'bankaccount': '6230200164878030',
        'bank': '华夏银行武汉东湖支行',
    },
    52: {
        'mchname': '天下支付科技有限公司',
        'name': '天下支付科技有限公司',
        'bankaccount': '79210157970000020',
        'bank': '上海浦东发展银行深圳分行科技园支行',
    },
}
